#include <stdio.h>
/*某侦察队接到一项紧急任务，要求在A、B、C、D、E、F六个队员中尽可能多地挑若干人，但有以下限制条件：
 1.A和B二人中至少去一人
 2.A和D不能一起去
 3.A、E和F三人中要派二人去
 4.B和C都去或都不去
 5.C和D两人中去一个
 6.若D不去，则E也不去*/
int main1() {
    int a,b,c,d,e,f;
    for(a=0;a<=1;a++)
        for (b=0; b<=1; b++)
            for (c=0; c<=1; c++)
                for (d=0; d<=1; d++)
                    for (e=0; e<=1; e++)
                        for (f=0; f<=1; f++)
                            if ((a||b)&(!(a&d))&(a+e+f==2)&(!(b^c))&(c^d)&(!(d==0&&e==1)))
                                printf("%d%d%d%d%d%d\n",a,b,c,d,e,f);
    return 0;
}
//111001
//abcdef
/*
 >有A、B、C、D、E，每人额头上贴了一张或黑或白的纸。5人对坐，都可看到其他人的颜色，但都不知道自己的颜色。5人相互观察：
 >A说：有三人额头上贴白纸，一人额头上贴的是黑纸
 >B说：我看见其他四人额头上贴的都是黑纸
 >C说：有一人额头上贴白纸，其他三人贴的是黑纸
 >D说：我看见四人额头上贴的都是白纸
 >E什么也没说
 >现在已知额头贴黑纸的人说的都是谎活，额头贴白纸的人说的都是实话。
 >问这五人谁的额头是贴白纸，谁的额头是贴黑纸？
 */
int main(){
    int a,b,c,d,e;
    int as,bs,cs,ds;
    //1为白 0为黑
    for(a=0;a<=1;a++)
        for (b=0; b<=1; b++)
            for (c=0; c<=1; c++)
                for (d=0; d<=1; d++)
                    for (e=0; e<=1; e++) {
                        as=(a+b+c+d+e>2);
                        bs=!(a|c|d|e);
                        cs=(a+b+d+e==1);
                        ds=(a&b&c&e);
                        if (a==as&b==bs&c==cs&d==ds)
                            printf("%d %d %d %d %d\n",a,b,c,d,e);
                    }
}
//0 0 1 0 1
/*
 11 0 00 0
 10 0 01 0
 01 0
 00 0
 */
